{"4641": "Where should I park my rainy-day / emergency fund?", "5503": "Tax considerations for selling a property below appraised value to family?", "3451": "Should you keep your stocks if you are too late to sell?", "4804": "How do financial services aimed at women differ from conventional services?", "2388": "Do financial advisors get better deals on mortgages?", "753": "Taxes due for hobbyist Group Buy", "4465": "How to donate to charity that will make a difference?", "3724": "Should you always max out contributions to your 401k?", "570": "Employer options when setting up 401k for employees", "594": "Should a retail trader bother about reading SEC filings", "3091": "Am I considered in debt if I pay a mortgage?", "904": "How do I set up Quickbooks for a small property rental company that holds its properties in separate LLC's?", "4037": "How separate individual expenses from family expenses in Gnucash?", "3357": "Why big clients want the contractor to be incorporated before giving them work", "1783": "Freelancing Tax implication", "2923": "Should I give to charity by check or credit card?", "5271": "Why are auto leases stubbornly strict about visa status and how to work around that?", "2108": "Can I pay taxes using bill pay from my on-line checking account?", "932": "Is freelance income earned by a U.S. citizen while living abroad subject to state income tax?", "4837": "When applying for a mortgage, can it also cover outstanding debts?", "4415": "How much is inflation?", "1915": "Should I pay a company who failed to collect VAT from me over 6 months ago?", "2316": "What exchange rate does El Al use when converting final payment amount to shekels?", "3405": "Non Resident aliens - Question of standard vs itemized", "603": "Will one’s education loan application be rejected if one doesn't have a payslip providing collateral?", "1281": "How FTB and IRS find mistakes in amended tax returns? Are their processes reliable?", "3830": "US citizen transferring money to Indian fiance to buy property", "3837": "Opening a Roth IRA account, what is the fee structure for Vanguard, Scottrade and TIAA-CREF", "4447": "Should I always hold short term bonds till maturity?", "2376": "Why do gas stations charge different amounts in the same local area?", "4777": "How to finance necessary repairs to our home in order to sell it?", "2318": "F1 student and eBay selling tax", "620": "Is it wise to have plenty of current accounts in different banks?", "4865": "Why are historical prices of stocks different on different websites? Which one should I believe?", "864": "Why use accounting software like Quickbooks instead of Excel spreadsheets?", "2568": "How to pay with cash when car shopping?", "5150": "What credit card information are offline US merchants allowed to collect for purposes other than the transaction?", "2857": "I have around 60K $. Thinking about investing in Oil, how to proceed?", "1085": "How do disputed debts work on credit reports?", "5422": "What are some good books for learning stocks, bonds, derivatives e.t.c for beginner with a math background?", "4946": "Something looks off about Mitsubishi financial data", "4571": "HSBC Hong Kong's “Deposit Plus” Product: What is it, and what strategies to employ?", "4600": "Why government bonds fluctuate so much, even though interest rates don't change that often?", "2423": "At what age should I start or stop saving money?", "4523": "What should I do with my $25k to invest as a 20 years old?", "1198": "What are the consequences of IRS “reclassification” on both employer and employee?", "1824": "Is there a way to open a U.S. bank account for my LLC remotely?", "5054": "How to stress test an investment plan?", "1159": "what is the best way to do a freelancing job over the summer for a student", "4920": "Does financing a portfolio on margin affect the variance of a portfolio?", "68": "Intentions of Deductible Amount for Small Business", "750": "Paid part of my state refund back last year; now must declare the initial amount as income?", "34": "401k Transfer After Business Closure", "4011": "How can I deal with a spouse who compulsively spends?", "4700": "Better to get loan from finance company or bank considering the drop of credit score?", "852": "Dalbar: How can the average investor lose money?", "1297": "Why aren't there solutions for electronic itemized receipt for retail in-store purchases?", "5085": "What is vested stock and yearly dividends?", "4767": "New car: buy with cash or 0% financing", "2593": "Am I “cheating the system” by opening up a tiny account with a credit union and then immediately applying for a huge loan?", "2724": "How do you determine the dividend payout date for Mutual Funds?", "18": "1 EIN doing business under multiple business names", "109": "How to account for money earned and spent prior to establishing business bank accounts?", "3480": "Why is OkPay not allowed in the United States?", "858": "Is it bad practice to invest in stocks that fluctuate by single points throughout the day?", "4019": "How and Should I Invest (As a college 18 year old with minimal living expenses)?", "2580": "Stock market vs. baseball card trading analogy", "5402": "Is it impossible to get a home loan with a poor credit history after a divorce?", "4504": "what is the best way of investment which gives returns forever?", "4775": "Should I finance a car to build credit for a mortgage next year?", "701": "What are the ins/outs of writing-off part of one's rent for working at home?", "585": "Following an investment guru a good idea?", "56": "Can a entrepreneur hire a self-employed business owner?", "4265": "Does it make any sense to directly contribute to reducing the US national debt?", "90": "Filing personal with 1099s versus business s-corp?", "5231": "Where to find CSV or JSON data for publicly traded companies listed with their IPO date?", "3103": "AVS Address Verification System of BOTH Credit and Debit Cards - WHERE, HOW?", "1415": "I am not VAT registered. Do I need to buy from my supplier with excl VAT prices or incl VAT?", "945": "Paid by an American company but working from France: where should I pay taxes?", "2549": "How to graph the market year over year? for example Dow Jones Index", "4714": "Personal finance app where I can mark transactions as “reviewed”?", "588": "Is there a reason to buy a 0% yield bond?", "4233": "Are personal finance / money management classes taught in high school, anywhere?", "106": "What approaches are there for pricing a small business?", "4306": "How do currency markets work? What factors are behind why currencies go up or down?", "5196": "I might use a credit card convenience check. What should I consider?", "3006": "Strategies for putting away money for a child's future (college, etc.)?", "3909": "How to rescue my money from negative interest?", "4116": "Would the effects of an anticipated default by a nation be mostly symbolic?", "4942": "find stock composition of a publicly traded fund", "5464": "Resources on Buying Rental Properties", "2385": "As director, can I invoice my self-owned company?", "691": "How to categorize credit card payments?", "3177": "Vanguard ETF vs mutual fund", "5090": "Should I take a student loan to pursue my undergraduate studies in France?", "2088": "How would I go about selling the stock of a privately held company?", "529": "Sole proprietorship or LLC?", "2118": "What happened in Argentina in 2001 bank sector? did the banks closed? all or some?", "3148": "Can a car company refuse to give me a copy of my contract or balance details?", "4955": "How to calculate the value of a bond that is priced to yield X%", "4678": "Finance, Cash or Lease?", "2398": "Frustrated Landlord", "3569": "Funds in closed bank account have gone to the government", "5511": "Pay off car loan entirely or leave $1 until the end of the loan period?", "813": "Income Tax and Investments", "1157": "Personal taxes for Shopify / Paypal shop?", "988": "Where should I invest my savings?", "3369": "Why should one only contribute up to the employer's match in a 401(k)?", "3490": "Tax Witholding for Stock Sale", "26": "Applying for and receiving business credit", "4962": "Net Cash Flows from Selling the Bond and Investing", "4846": "Is there anything comparable to/resembling CNN's Fear and Greed Index?", "2460": "What are the consequences of not respecting a notice period when leaving a job?", "3503": "Is there any instance where less leverage will get you a better return on a rental property?", "2676": "Tax question about selling a car", "929": "Freelancer: Should I start a second bank account?", "475": "Do I need a new EIN since I am hiring employees for my LLC?", "5021": "Is there a more flexible stock chart service, e.g. permitting choice of colours when comparing multiple stocks?", "2968": "Should I prioritize retirement savings inside of my HSA?", "3612": "How can I buy and sell the same stock on the same day?", "4153": "How do I invest in emerging markets", "4409": "My friend wants to put my name down for a house he's buying. What risks would I be taking?", "5369": "Paying for things on credit and immediately paying them off: any help for credit rating?", "2070": "Advantage of credit union or local community bank over larger nationwide banks such as BOA, Chase, etc.?", "5505": "Can I deduct interest and fees on a loan for qualified medical expenses?", "5460": "Paying off a loan with a loan to get a better interest rate", "4286": "Given advice “buy term insurance and invest the rest”, how should one “invest the rest”?", "3789": "How to work around the Owner Occupancy Affidavit to buy another home in less than a year?", "5228": "How does the bank/IRS know whether a bank transfer over $14k is a gift or loan repayment?", "2685": "What ways are there for us to earn a little extra side money?", "1877": "As a Sole Proprietor, will “employer” Solo 401k contributions count towards gross income?", "1090": "Need a formula to determine monthly payments received at time t if I'm reinvesting my returns", "3682": "Short selling - lender's motivation", "4514": "What intrinsic, non-monetary value does gold have as a commodity?", "1819": "Found an old un-cashed paycheck. How long is it good for? What to do if it's expired?", "3008": "What are my chances at getting a mortgage with Terrible credit but High income", "4007": "What is a reasonable salary for the owner and sole member of a small S-Corp?", "4844": "How to read bond yield quotes? What do the time, coupon, price, yield, and time mean?", "2498": "How do I calculate tax liability on the turnover of a small vendor?", "2010": "Paypal website donations without being a charity", "3767": "What should I be doing to protect myself from identity theft?", "2445": "How do I notify the IRS of a new member to an LLC?", "5155": "For insurance, why should you refuse $4,000/year for only 10 years and prefer $500/year indefinitely?", "5030": "Why pay for end-of-day historical prices?", "885": "How long do credit cards keep working after you disappear?", "4031": "28 years old and just inherited large amount of money and real estate - unsure what to do with it", "766": "Will the ex-homeowner still owe money after a foreclosure?", "2183": "Why are there many small banks and more banks in the U.S.?", "5086": "Mortgage loan implications when tearing down existing house and building new one?", "2648": "How does unemployment insurance work?", "776": "Can saving/investing 15% of your income starting age 25, likely make you a millionaire?", "5125": "Regarding Australian CBS takeover of TEN", "89": "How can I deposit a check made out to my business into my personal account?", "2516": "Which banks have cash-deposit machines in Germany?", "4484": "Has the likelihood of getting a lower interest rate by calling & asking been reduced by recent credit card regulations?", "1451": "How do you find an ethical, honest independent insurance broker in Canada?", "1889": "Reporting financial gains from my online store", "1920": "Clarification on student expenses - To file the tax for the next year", "3759": "Simplifying money management", "4312": "Is it true that 90% of investors lose their money?", "1230": "How does Walmart account their expired food", "2486": "Is working on a W2 basis, with benefits paid to me, a good idea?", "859": "Any reason to keep around my account with my old, 'big' bank?", "2590": "Are non-residents or foreigners permitted to buy or own shares of UK companies?", "3781": "What is the rough estimate of salary value for a taxpayer to pay AMT?", "5374": "What were the main causes of the spike and drop of DRYS's stock price?", "1310": "Is is possible to take a mortgage using Bitcoin as collateral?", "2994": "Work on the side for my wife's company", "3125": "Claiming mileage allowances, what are the rules/guidelines?", "3683": "Can I trust the Motley Fool?", "939": "How to correct a tax return filed electronically and already approved?", "5241": "Mortgage vs. Cash for U.S. home buy now", "98": "How can I make $250,000.00 from trading/investing/business within 5 years?", "5064": "How much should a graduate student attempt to save?", "4615": "Are solar cell panels and wind mills worth the money?", "1676": "W2 vs 1099 Employee status", "503": "Privacy preferences on creditworthiness data", "3264": "Pros and Cons of Interest Only Loans", "4289": "Does the currency exchange rate contain any additional information at all?", "4394": "Transfer $50k to another person's account (in California, USA)", "4047": "Does doing your “research”/“homework” on stocks make any sense?", "1815": "Rules for SEP contributions in an LLC?", "549": "Where to request ACH Direct DEBIT of funds from MY OWN personal bank account?", "2407": "How long to wait after getting a mortgage to increase my credit limit?", "2856": "How can I cash out a check internationally?", "2395": "Freelance site with lowest commission fees?", "2695": "Buy a parking spot and rent it out, or invest savings in an interest-bearing account?", "5616": "How and where do companies publish financial reports?", "928": "How can I determine if a FHA loan refinance offer is from a reputable lender", "5427": "How do auto-loan payments factor into taxes for cars that are solely used by dependent(s)?", "2587": "Typically how many digits are in a cheque number?", "1284": "Tax consequences when foreign currency changes in value", "2443": "What are some way to transfer money from Hong Kong to India on a monthly basis?", "3179": "Calculation, timing, and taxes related to profit distribution of an S-corp?", "3404": "In US, is it a good idea to hire a tax consultant for doing taxes?", "3453": "How does spot-futures arbitrage work in the gold market?", "5045": "Why are we taxed on revenue and companies on profit?", "4845": "What is the difference between fund and portfolio?", "3625": "What should I do with my paper financial documents?", "4464": "Are Australian mutual fund fees large compared to US?", "3822": "How to change a large quantity of U.S. dollars into Euros?", "3115": "How can I live outside of the rat race of American life with 300k?", "3995": "I have more than $250,000 in a US Bank account… mistake?", "559": "Challenged an apparently bogus credit card charge, what happens now?", "3791": "\"When people say 'Interest rates are at all time low!\"\" … Which interest rate are they actually referring to?\"", "4179": "Why could the serious financial woes of some EU member states lead to the end of the Euro?", "2891": "May I claim money earned but not received in 2012", "853": "What will my taxes be as self employed?", "2513": "How does revenue shared with someone else go into my tax return in Canada?", "5206": "Is it a good idea to get an unsecured loan to pay off a credit card that won't lower a high rate?", "4433": "When should you use an actively managed mutual fund in a 401k?", "4188": "Why is the stock market rising after Trump's attack on the TPP?", "2713": "Physical Checks - Mailing", "3829": "Are all VISA cards connected with bank accounts?", "5585": "Is there any site you can find out about the 'bonus features' of credit cards?", "4105": "As an investor what are side effects of Quantitative Easing in US and in EU?", "1074": "How common is “pass-through” health insurance?", "2465": "Can capital expenses for volunteer purposes be deducted from income?", "4640": "What can my relatives do to minimize their out of pocket expenses on their fathers estate", "3500": "Why invest in becoming a landlord?", "4205": "How and why does the exchange rate of a currency change almost everyday?", "1306": "I made an investment with a company that contacted me, was it safe?", "1826": "Is the contribution towards Employment Insurance (EI) wasted if I never get fired, or are my premiums refunded?", "5347": "car loan life insurance", "4500": "What to ask Warren Buffet at the Berkshire Hathaway shareholder meeting?", "3615": "My previous and current employers both use Fidelity for 401(k). Does it make sense to rollover?", "1948": "Which colors can one use to fill out a check in the US?", "3771": "Best way to buy Japanese yen for travel?", "1736": "How can people have such high credit card debts?", "5255": "Thrift Saving Plan (TSP) Share Price Charts", "5380": "Can somebody explain “leveraged debt investment positions” and “exposures” in this context for me, please?", "2051": "Where to find the 5 or 10 year returns for a mutual fund?", "5067": "LLC: Where should the funds for initial startup costs come from?", "4756": "What is the formula for the Tesla Finance calculation?", "2076": "Can vet / veterinary bills be considered deductions (tax-deductible) for Income Tax purposes [Canada]?", "1322": "Is this follow-up after a car crash a potential scam?", "2880": "Can I transfer my investment property into a SMSF?", "5172": "does interest payment on loan stay the same if I pay early", "5185": "Invest in low cost small cap index funds when saving towards retirement?", "2348": "Why can't you just have someone invest for you and split the profits (and losses) with him?", "687": "Online tool to connect to my bank account and tell me what I spend in different categories?", "4499": "Is investing exlusively in a small-cap index fund a wise investment?", "42": "What are the ins/outs of writing equipment purchases off as business expenses in a home based business?", "3530": "How to exclude stock from mutual fund", "5592": "Are “hard money loans” meant only for real estate?", "659": "Buying from an aggressive salesperson", "4414": "Do high interest rates lead to higher bond yields or lower?", "3067": "Should I make extra payments to my under water mortgage or increase my savings?", "4125": "Alternative means of salary for my employees", "1150": "How are the best way to make and save money at 22 years old", "2384": "Tax: 1099 paper form", "895": "California tells me I didn't file documents for an LLC that isn't mine. What do I do?", "879": "Capital improvement and depreciation in restaurant LLC", "3051": "What items are exempt from the VAT? [U.K.]", "4813": "Dealer Financing Fell Through on vehicle purchase: Scam?", "3888": "Why I can't view my debit card pre-authorized amounts?", "957": "How can I withdraw money from my LLC?", "1871": "Is there any US bank that does not charge for incoming wire transfers?", "5331": "Exercises of employee share options", "2790": "Should I pay more than 20% down on a home?", "4999": "Looking for a good source for Financial Statements", "4142": "Relation between inflation rates and interest rates", "3189": "Diversify my retirement investments with a Roth IRA", "5134": "Why does Yahoo Finance's data for a Vanguard fund's dividend per share not match the info from Vanguard?", "1321": "Are social media accounts (e.g. YouTube, Twitter, Instagram, etc.) considered assets?", "3049": "How to calculate my estimated taxes. 1099 MISC + Self Employment", "849": "Accounting for reimbursements that exceed actual expenses", "4539": "How should I save money if the real interest rate (after inflation) is negative?", "4084": "What industries soar when oil prices go up?", "715": "what would you do with $100K saving?", "2416": "Why should a company go public?", "2204": "What's an economic explanation for why greeting cards are so expensive?", "2334": "How do you determine “excess cash” for Enterprise Value calculations from a balance sheet?", "2903": "How should I file my taxes as a contractor?", "4827": "Are all financial advisors compensated in the same way?", "5534": "How does “taking over payments” work?", "1530": "What is the proper way to report additional income for taxes (specifically, Android development)?", "504": "Have plenty of cash flow but bad credit", "721": "What are “upstream investments” and “downstream investments” in this context?", "2296": "How does a bank make money on an interest free secured loan?", "3186": "United States Treasury Not Endorsing Checks", "3859": "Buying an investment property in Australia - what are the advantages and disadvantages of building a house vs buying an existing one?", "1994": "Does the IRS reprieve those who have to commute for work?", "1812": "splitting a joint mortgage - one owner in home", "4968": "Reasons behind a large price movement of a penny stock without any recent news releases?", "3534": "Why do dishonour fees exist?", "2737": "What to do with an old building to get money", "2964": "Unmarried Couple Splitting up with Joint Ownership of Home", "5178": "Formula that predicts whether one is better off investing or paying down debt", "5061": "What fiscal scrutiny can be expected from IRS in early retirement?", "4411": "How does the importance of a cash emergency fund change when you live in a country with nationalized healthcare?", "515": "financial institution wants share member break down for single member LLC", "2075": "Are stories of turning a few thousands into millions by trading stocks real?", "4335": "What is the US Fair Tax?", "4785": "What is the difference between a structured collar and a normal collar in finance?", "3528": "In the US, does getting a loan with a cosigner, help your credit rating?", "1393": "Which is better when working as a contractor, 1099 or incorporating?", "5264": "Does a company's stock price give any indication to or affect their revenue?", "4339": "What could happen to Detroit Municipal bonds because of Detroit's filing for bankruptcy?", "744": "What options are available for a home loan with poor credit but a good rental history?", "672": "Credit and Debit", "4071": "If our economy crashes, and cash is worthless, should i buy gold or silver", "4103": "What causes US Treasury I bond fixed interest to increase?", "1441": "What's the difference between Market Cap and NAV?", "3254": "Why do people buy US dollars on the black market?", "2589": "How can I detect potential fraud in a company before investing in them?", "2598": "Is it possible for US retail forex traders to trade exotic currencies?", "1391": "How is taxation for youtube/twitch etc monetization handled in the UK?", "5356": "Historical stock prices: Where to find free / low cost data for offline analysis?", "2579": "What to do when a job offer is made but with a salary less than what was asked for?", "689": "Receive credit card payment sending my customer details to a credit card processing company?", "604": "Is there a dollar amount that, when adding Massachusetts Sales Tax, precisely equals $200?", "4681": "How to fix Finance::Quote to pull quotes in GnuCash", "1670": "Investing in hemp producers in advance of possible legalization in Canada?", "2383": "Should I Purchase Health Insurance Through My S-Corp", "3085": "How long can I convert 401(k) to Roth 401(k)?", "104": "Investing/business with other people's money: How does it work?", "5083": "Co-signer deceased", "684": "Beyond RRSP deductions, how does a high income earner save on taxes?", "3594": "If I were to get into a life situation where I would not be able to make regular payments, do lenders typically provide options other than default?", "2181": "What are the risks & rewards of being a self-employed independent contractor / consultant vs. being a permanent employee?", "5620": "What's the fuss about identity theft?", "5254": "How do I calculate the quarterly returns of a stock index?", "3446": "What's the difference between Term and Whole Life insurance?", "2472": "How do I deal with a mistaken attempt to collect a debt from me that is owed by someone else?", "2306": "To whom should I report fraud on both of my credit cards?", "2400": "Will I be paid dividends if I own shares?", "5549": "Pros / cons of being more involved with IRA investments [duplicate]", "1832": "Warren Buffett and Charles Munger advice for small investors?", "2749": "Is it possible to create a self-managed superannuation fund to act as a mortage offset? (Australia)", "3801": "Can a bunch of wealthy people force Facebook to go public?", "3735": "Shorting Stocks And Margin Account Minimum", "622": "Accidentally opened a year term CD account, then realized I need the money sooner. What to do?", "4605": "If the U.S. defaults on its debt, what will happen to my bank money?", "2330": "How can I determine if a debt consolidation offer is real or a scam?", "2885": "Merits of buying apartment houses and renting them", "15": "Can I send a money order from USPS as a business?", "4823": "Close to retirement & we may move within 7 years. Should we re-finance our mortgage, or not?", "3694": "Has anyone created a documentary about folks who fail to save enough for retirement?", "8": "How to deposit a cheque issued to an associate in my business into my business account?", "1309": "Why does FlagStar Bank harass you about payments within grace period?", "3039": "Can increasing my tax withholding from my full-time job cover FICA taxes for my freelance work?", "699": "Prepaid Rent (Accrual Based Accounting)", "5080": "Is there a standard or best practice way to handle money from an expiring UTMA account?", "4981": "Where can I find open source portfolio management software?", "3875": "Does freedom to provide services allow me contracting in Germany without paying taxes there (but in my home EU country)?", "3932": "How do historically low interest rates affect real estate prices?", "3934": "Should market based health insurance premiums be factored into 6 months emergency fund savings?", "2264": "Personal Tax Return software for Linux?", "2895": "Where should a young student put their money?", "2747": "What evidence do I need to declare tutoring income on my income tax?", "1933": "UK sole trader who often buys products/services on behalf of clients – do I deduct from declared income or claim as allowable expenses?", "1748": "How high should I set my KickStarter funding goal in order to have $35,000 left over?", "3014": "What investments are positively related to the housing market decline?", "4863": "How to calculate new price for bond if yield increases", "3149": "Tips for insurance coverage for one-man-teams", "1416": "US resident with Canadian income via T4A-NR", "2801": "If I deposit money as cash does it count as direct deposit?", "5343": "“International credit report” for French nationals?", "547": "What percentage of my company should I have if I only put money?", "2154": "What tax software automatically determines the best filing status, etc?", "3394": "What is the easiest way to back-test index funds and ETFs?", "5410": "Dealership made me the secondary owner to my own car", "810": "Can I open a bank account in the US remotely? Will I pay taxes for the money on it?", "3033": "Tax consequences of changing state residency?", "1469": "Why do some companies report how well their EBITDA performed even if their overall net profit did equally well?", "3512": "As an employee, when is it inappropriate to request to see your young/startup company's financial statements?", "4102": "How can I determine if my rate of return is “good” for the market I am in?", "3566": "Where can I buy stocks if I only want to invest a little bit at a time, and not really be involved in trading?", "94": "Using credit card points to pay for tax deductible business expenses", "2551": "How to find cheaper alternatives to a traditional home telephone line?", "2399": "Where do web sites get foreign exchange currency rate / quote information?"}